AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/LESStep/case/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name constraint;
        patchInfo
        {
            type symmetry;
        }
        constructFrom patches;
        patches ( "patch_1_.*" );
    }
    {
        name wall;
        patchInfo
        {
            type symmetry;
        }
        constructFrom patches;
        patches ( "patch_2_.*" );
    }
    {
        name wall001;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches ( "patch_3_.*" );
    }
    {
        name inlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_4_.*" );
    }
    {
        name outlet;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_5_.*" );
    }
    {
        name defaultFaces;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_0_0" );
    }
);


// ************************************************************************* //
